INSERT INTO users(UserLogin, UserPassword, UserName, UserSurname, UserPatronymic, Phone, Email, Companyname, Role)
VALUES
('123', '123', 'Иван', 'Иванов', 'Иванович', '+7(982)932-54-12', 'ivanivan@mail.ru','ООО Базис-Моторс', 'Админ');

INSERT INTO suppliers(SupplierName, ContactName, ContactEmail, ContactPhone)
VALUES
('Кирпичный завод','Вадим','buildfactory@mail.ru','+7(982)941-23-12'),
('Завод Газобетона','Петр','gasbuild@mail.ru','+7(961)205-32-64'),
('Полимерный завод','Владимир','polymer@mail.ru','+7(925)431-23-61');

INSERT INTO inventory(ProductName, Quantity, Price, Type, SupplierPrice, SupplierID)
VALUES
('Кирпич','50', '20', 'Товар', '15','1'),
('Строительные блоки','50', '30', 'Товар', '25','1'),
('Железобетонные блоки','50', '2000', 'Товар', '1700', '1'),
('Газобетонные блоки','50', '6000', 'Товар', '5000','2'),
('Газосиликатные блоки','50', '50', 'Товар', '45','2'),
('Сухие смеси','50', '150', 'Товар','100', '3'),
('Грунтовка','50', '500', 'Товар', '450', '3'),
('Пескобетон','50', '250', 'Товар', '200', '3'),
('Утюг','0','1000','Услуга', '', '');

INSERT INTO customers(CName, CSurname, CPatronymic, Email, Phone, Address)
VALUES
('Екатерина', 'Смирнова', 'Дмитриевна', 'ekaterina.smirnova@gmail.com', '+7(994)480-20-24', 'ул. Гоголя, дом 4, кв. 40'),
('Михаил', 'Иванов', 'Сергеевич', 'mikhail.ivanov@gmail.com', '+7(904)541-43-65', 'ул. Лермонтова, дом 5, кв. 50'),
('Анастасия', 'Кузнецова', 'Андреевна', 'anastasia.kuznetsova@gmail.com', '+7(994)299-12-30', 'ул. Пушкина, дом 6, кв. 60'),
('Илья', 'Соколов', 'Александрович', 'ilya.sokolov@gmail.com', '+7(986)964-06-83', 'ул. Тургенева, дом 7, кв. 70'),
('Дарья', 'Попова', 'Анатольевна', 'darya.popova@gmail.com', '+7(980)812-81-99', 'ул. Чехова, дом 8, кв. 80'),
('Артём', 'Новиков', 'Николаевич', 'artem.novikov@gmail.com', '+7(956)274-10-69', 'ул. Гончарова, дом 9, кв. 90'),
('Ольга', 'Морозова', 'Максимовна', 'olga.morozova@gmail.com', '+7(984)499-07-98', 'ул. Достоевского, дом 10, кв. 100'),
('Александр', 'Петров', 'Иванович', 'alexander.petrov@gmail.com', '+7(985)290-16-12', 'ул. Толстого, дом 11, кв. 110'),
('Евгения', 'Васильева', 'Денисовна', 'evgenia.vasilieva@gmail.com', '+7(963)824-27-13', 'ул. Пастернака, дом 12, кв. 120'),
('Андрей', 'Соловьёв', 'Романович', 'andrey.solovyov@gmail.com', '+7(988)879-16-61', 'ул. Гоголя, дом 13, кв. 130'),
('Анастасия', 'Михайлова', 'Дмитриевна','anastasia.mikhailova@gmail.com', '7(900)280-63-53', 'ул. Лермонтова, дом 14, кв. 140');
